#!/usr/bin/env python3
# -*- coding: utf-8 -*-
school = {"1а": 22, "1б": 12, "2а": 23, "2б": 21, "3а": 29, "3б": 22, "4а": 18, "4б": 24, "5а": 23, "5б": 17,
          "6а": 20, "6б": 15, "7а": 19, "7б": 25, "8а": 25, "8б": 25, "9а": 25, "9б": 18, "10а": 24, "10б": 22,
          "11а": 24, "11б": 23}  # Словарь классов с количеством учащихся

school["7б"] = 17  # Во 7б классе изменилось количество учащихся

school["2в"] = 19  # В школе появился 2в класс

del school["11б"]  # Класс 11б был удален

print(f"Всего учеников в школе: {sum(school.values())}")  # Выводим на экран общее число учащихся в школе